package com.xxx.day13.extends01;

public class Extends01 {
    /*
    *   1、什么是继承、继承的好处？
            继承是面向对象的三大特征之一，可以让类跟类之间产生子父的关系
            可以把多个子类中重复的代码抽取到父类中，子类可以直接使用，减少代码冗余，提高代码的复用性

         2、继承的格式？
            class A extends B

         3、继承后子类的特点？
             子类可以得到父类的属性和行为、子类可以使用
             子类可以在父类的基础上新增其他功能，子类更强大
             *
         4、java只支持单继承，不支持多继承，但支持多层继承
            单继承：一个子类只能继承一个父类
            不支持多继承：子类不能同时继承多个父类
            多层继承：爷爷 -> 爸爸 -> 儿子
         每一个类都直接或者间接的继承与 Object
    * */


}
