package com.xxx.collection24;

public class DataStructure05 {
    public static void main(String[] args) {
        /*
        * 栈：后进先出，先进后出
        *   数据进入栈模型的过程称为 ：压/进栈
        *   数据离开栈模型的过程称为 ： 弹/出栈
        * 栈顶元素：
        * 栈底元素：
        *
        * 队列：先进先出,后进后出
        *   数据从后端进入队列模型的过程称为 ： 入队列
        *   数据从前端离开队列模型的过程称为 ： 出队列
        *
        *数组：(查询快，增删慢)
        *   查询速度快：查询数据通过地址值和索引定位，查询任意数据耗时相同（元素在内存中是连续存储的）
        *   删除效率低：要将原始数据删除，同时后面每个数据前移
        *   添加效率极低：添加位置后的每个数据后移，再添加元素
        *
        *
        * 链表：
        *   结点：里面存放数据和下一个结点的地址
        * 链表中的结点是独立的对象，在内存中是不连续的，每个结点包含数据值和下一个结点的地址值
        * 链表查询慢，无论查询那个数据都要从头开始找
        * 创建一个链表：每一个结点都有属于自己的地址
        *   head ^   添加一个数据 A ，先创建一个新结点，将数据添加到新结点中，把头结点的地址值修改为新结点的地址值
        *
        * */
    }
}
